In [41]:
import pandas as pd

In [42]:
import numpy as np

In [79]:
movies = pd.read_csv("movies.csv")

2. we are only interested in the movies’ titles, their runtime as well as their budget. Select the three columns that contain this information and save them into a new variable called movies_selected

In [112]:
movies_selected = movies.loc[:, ["title", "budget", "runtime"]]

3. now take your subsetted data movies_selected, and count the number of missing values in each column.

In [65]:
movies_selected.isna().sum()

title      0
budget     0
runtime    2
dtype: int64

4. There’s not too many NAs, but there are actually quite a few movies with a runtime of 0 in this dataset. Since it’s impossible for a movie to have a runtime of 0, use the function na_if to convert runtimes of length 0 into NAs. Save this into a new variable called movies_runtime. Then count how many missing values there are now in the column runtime

In [66]:
movies_selected.runtime.sort_values().head(40)

4118     0.0
4210     0.0
4205     0.0
4571     0.0
4569     0.0
4566     0.0
4564     0.0
3992     0.0
4611     0.0
4558     0.0
3112     0.0
4458     0.0
4553     0.0
4729     0.0
4068     0.0
4405     0.0
3809     0.0
4581     0.0
4328     0.0
4620     0.0
4502     0.0
4504     0.0
4313     0.0
4318     0.0
4633     0.0
3953     0.0
4584     0.0
4322     0.0
4241     0.0
4657     0.0
4658     0.0
4662     0.0
3669     0.0
1011     0.0
4435     0.0
4466    14.0
4709    25.0
3626    41.0
3471    42.0
3354    46.0
Name: runtime, dtype: float64

In [113]:
movies_selected["runtime"] = movies_selected["runtime"].replace(0, np.nan)

In [82]:
movies_selected.loc[:, "runtime"].sort_values().head(40) #check this has been completed successfully

4466    14.0
4709    25.0
3626    41.0
3471    42.0
3354    46.0
4756    47.0
3403    53.0
4685    59.0
4785    60.0
1620    63.0
4774    64.0
4673    66.0
3663    67.0
2182    68.0
4733    68.0
4493    68.0
4668    69.0
3208    69.0
2805    69.0
4491    70.0
4721    70.0
4441    70.0
2116    72.0
4641    72.0
2114    72.0
1984    72.0
4710    72.0
4642    73.0
4612    73.0
2427    73.0
4711    73.0
3059    74.0
465     74.0
4014    74.0
1029    75.0
4746    75.0
4265    75.0
3281    75.0
4646    75.0
4767    75.0
Name: runtime, dtype: float64

5. Impute the missing values in runtime with the median runtime using coalesce and save this into a new variable called movies_imputed. There should now be no missing values in the column runtime - check this to make sure.

In [114]:
movie_average_runtime = round(movies_selected["runtime"].mean()) # create a variable of average runtime

In [115]:
movies_selected["runtime"] = movies_selected["runtime"].replace(np.nan, movie_average_runtime)

In [85]:
movies_selected["runtime"].isna().sum() # check this has completed successfully

0

6. Finally, use the slice_min and slice_max functions on movies_imputed to get the movies with the 10 shortest and 10 longest runtimes.

In [87]:
movies_selected.nlargest(10, "runtime")

                            title    budget  runtime
2384                       Carlos  18000000    338.0
2631                  The Company         0    276.0
1922                   Gettysburg         0    254.0
1125                    Cleopatra  31115000    248.0
2373                       Hamlet         0    242.0
3510                         Emma         0    240.0
3813           Gone with the Wind   4000000    238.0
1663  Once Upon a Time in America  30000000    229.0
4497                    Woodstock    600000    225.0
1109                Heaven's Gate  44000000    219.0

In [89]:
movies_selected.nsmallest(10, "runtime")

                                                  title    budget  runtime
4466                                             Vessel         0     14.0
4709                          A Charlie Brown Christmas         0     25.0
3626         Sea Rex 3D: Journey to a Prehistoric World   5000000     41.0
3471           Dolphins and Whales: Tribes of the Ocean   6000000     42.0
3354                          Michael Jordan to the Max         0     46.0
4756                                The Call of Cthulhu     50000     47.0
3403  Alpha and Omega: The Legend of the Saw Tooth Cave         0     53.0
4685                       The Case of the Grinning Cat         0     59.0
4785                               Stories of Our Lives         0     60.0
1620                                    Winnie the Pooh  30000000     63.0

7. Using the if_else function, impute anything with a budget below $100 with the median budget. Overwrite your movies_imputed so it contains the new budget values.

In [116]:
movies_average_budget = round(movies_selected.budget.mean())

In [117]:
movies_average_budget

29045040

In [118]:
movies_selected["budget"] = np.where(movies_selected["budget"] > 100, movies_selected["budget"],  movies_average_budget)

In [119]:
movies_selected

                                         title     budget  runtime
0                                       Avatar  237000000    162.0
1     Pirates of the Caribbean: At World's End  300000000    169.0
2                                      Spectre  245000000    148.0
3                        The Dark Knight Rises  250000000    165.0
4                                  John Carter  260000000    132.0
...                                        ...        ...      ...
4798                               El Mariachi     220000     81.0
4799                                 Newlyweds       9000     85.0
4800                 Signed, Sealed, Delivered   29045040    120.0
4801                          Shanghai Calling   29045040     98.0
4802                         My Date with Drew   29045040     90.0

[4803 rows x 3 columns]